<?php

use OOP\POLIMORFIZM\News;
use OOP\POLIMORFIZM\Owners;

require_once "../../composer/vendor/autoload.php";


$news = new News([1,2]);
$owners = new Owners([1]);
echo $news->get_DB_Value('name');
$news->do_print();
$owners->do_print();
/**
 * Трохи теорії
 * Методи, що потребують перевизначення, називаються абстрактними. Логічно,
 * якщо клас містить хоча б один абстрактний метод, він теж є абстрактним.

 * Очевидно, що об'єкт абстрактного класу неможливо створити,
 * інакше він не був би абстрактним.

 * Похідний клас має властивості та методи, що належать базовому класу, і,
 * крім того, може мати власні методи та властивості.

 * Метод, що перевизначається у похідному класі, називається віртуальним.
 * У базовому абстрактному класі про цей метод немає жодної інформації.

 * Суть абстрагування в тому, щоб визначати метод у тому місці
 * , де є найповніша інформація про те, як він має працювати.
 */
